{'title': 'General Hiring: Software Engineer,TikTok Product Engineering', 'companyName': 'TikTok', 'location': 'TikTok', 'salaryGuides': ['Not provided by employer', "$92.8K - $118K a year is Indeed's estimated salary for this role in New York, NY..css-11vwnmi{box-sizing:border-box;margin:0;min-width:0;margin-left:0.5rem;height:16px;position:relative;top:-4px;border:0;background:transparent;padding:0;vertical-align:middle;}.css-11vwnmi:focus{outline:auto;}.css-1nhvvuv{width:1.25rem;height:1.25rem;color:inherit;}"], 'jobDescriptionText': "TikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. TikTok has global offices including Los Angeles, New York, London, Paris, Berlin, Dubai, Mumbai, Singapore, Jakarta, Seoul, and Tokyo. \n\n By applying to this position you will be considered for the following locations: San Francisco, CA; Mountain View, CA; Seattle, WA, New York, NY. \n\n \nAbout the TikTok Product Engineering Team:\n The TikTok Product engineering team has a strong user focus and a dedication to technical excellence; you will be building products that inspire creativity and bring joy to billions of users. Some of our sub-teams are Creation Suites, Creator Management, Content Growth, Open Platform, Product Infrastructure, Privacy, User Growth, etc. \n\n You will join a team consisting of creative, passionate developers who always strive to stay at the forefront of technologies. We constantly push the limits of what our technology is capable of, strive to be leaders in innovation, and deeply value the diversity of the team's background. \n\n \nAbout the TikTok Product Engineering Bootcamp:\n TikTok Engineering Bootcamp program offers a great opportunity for engineer new joiners to engage with different product engineering teams, immerse with a variety of projects and connect with senior engineering professionals at TikTok. The new joiners will have opportunities to select a team that they see best fit to join through the Bootcamp program. \n\n \nResponsibilities:\n \n \n Develop large-scale software systems that power the TikTok app, specific responsibilities vary by team/focus area; \n Manage individual project priorities, deadlines, and deliverables; \n Collaborate with multiple cross-functional teams to deliver high-quality work in rapid product development. \n BS degree or above in Computer Science or related fields or equivalent practical experience, with 0-2 years of working experience; \n Proficient programming, debugging, and optimization skills in one or more general-purpose programming languages including but not limited to: Java, C/C++, C#, Objective C, Python, JavaScript, or Go; \n \nPreferred Qualifications:\n \n \n Experienced in building technical services for large-scale consumer-facing applications. \n A solid foundation in computer science, with competencies in data structures, algorithms, and software design. \n Strong written/verbal communication and teamwork skills; flexible and be a self-starter. \n TikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We believe individuals shouldn't be disadvantaged because of their background or identity, but instead should be considered based on their strengths and experience. We are passionate about this and hope you are too. \n\n TikTok is committed to providing reasonable accommodations during our recruitment process. If you need assistance or an accommodation, please reach out to us at usrc@tiktok.com."}
